In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_excel('Book4.xlsx')
data

     Country    State  Literacy Rate  Salaries
0   Pakistan      KPK           78.4    100000
1      India       UP           34.5    200000
2  Australia    Wales           34.4    500000
3      China  Biejing           23.3    750000
4  NewZeland  Aukland           12.2    800500
5    England   London            1.1    550000

In [22]:
data['Salaries'][1] = 300000

<ipython-input-22-12c364f8255c>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['Salaries'][1] = 300000

In [19]:
data['State'][1] = 'Punjab'

<ipython-input-19-9097200f666c>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['State'][1] = 'Punjab'

In [10]:
data.groupby(['Salaries']).count()

          Country  State  Literacy Rate
Salaries
100000          2      2              2
500000          1      1              1
550000          1      1              1
750000          1      1              1
800500          1      1              1

In [11]:
data

     Country    State  Literacy Rate  Salaries
0   Pakistan      KPK           78.4    100000
1      India       UP           34.5    100000
2  Australia    Wales           34.4    500000
3      China  Biejing           23.3    750000
4  NewZeland  Aukland           12.2    800500
5    England   London            1.1    550000

In [25]:
data.groupby('Country').Salaries.count()

Country
Australia    1
China        1
England      1
NewZeland    1
Pakistan     2
Name: Salaries, dtype: int64

In [26]:
data.groupby('Country').Salaries.min()

Country
Australia    500000
China        750000
England      550000
NewZeland    800500
Pakistan     100000
Name: Salaries, dtype: int64

In [27]:
data.groupby('Country').Salaries.max()

Country
Australia    500000
China        750000
England      550000
NewZeland    800500
Pakistan     300000
Name: Salaries, dtype: int64

In [28]:
data

     Country    State  Literacy Rate  Salaries
0   Pakistan      KPK           78.4    100000
1   Pakistan   Punjab           34.5    300000
2  Australia    Wales           34.4    500000
3      China  Biejing           23.3    750000
4  NewZeland  Aukland           12.2    800500
5    England   London            1.1    550000